[
  {
    "id": 1,
    "name": "Darryn Peterson",
    "position": "SG,SF",
    "school": "Kansas",
    "height": "6-5",
    "weight": null,
    "talent": 90,
    "notes": "Parsed from big board cell | 6-5 – | . A near lock to go in the top 3 and a serious contender to go no.1 overall. Peterson is an unstoppable force on the offensive end, able to score from anywhere and do it with high efficiency. He’s also a very high level defender who can lock down on the ball and his a menace in the passing lanes. | – An elite talent and one of the best guards to enter the college ranks in the past decade",
    "rank": 1
  },
  {
    "id": 2,
    "name": "AJ Dybantsa",
    "position": "SF,PF",
    "school": "BYU",
    "height": "6-9",
    "weight": null,
    "talent": 89,
    "notes": "Parsed from big board cell | will be too low | 6-9 – | will be too low. AJ is a power wing who can initiate the offense, get his own shot and impose his will on the game. He’s a force going to the basket and has a knack for getting into the lane and scoring through contact. He reminds me of a jumbo-sized version of RJ Barrett, which is an All Star level player who could be a franchise cornerstone. | – If the 3pt shot comes along this ranking",
    "rank": 2
  },
  {
    "id": 3,
    "name": "Cameron Boozer",
    "position": "PF,C",
    "school": "Duke",
    "height": "6-9",
    "weight": null,
    "talent": 88,
    "notes": "Parsed from big board cell | Boozer is a one of the most efficient scorers and overall contributors you’ll ever see | 6-9 – | Boozer is a one of the most efficient scorers and overall contributors you’ll ever see. He does a bit of everything on the court, is unselfish, a great decision maker and a bucket-getter. He’s not going to have the best highlights of all the prospects in this class but when it’s all said and done he could be one of the leading scorers and rebounders in the college game and live up to his hype as one of the top prospects in the class. | –",
    "rank": 3
  },
  {
    "id": 4,
    "name": "Nate Ament",
    "position": "SF",
    "school": "Tennessee",
    "height": "6-9",
    "weight": null,
    "talent": 87,
    "notes": "Parsed from big board cell | Ament is oozing with upside potential as a long and wiry 6-9+ shot-maker | 6-9 – | Ament is oozing with upside potential as a long and wiry 6-9+ shot-maker. He can handle the ball, get is own offense and is a constant threat to put the ball in the basket. He’s added a lot of good weight/strength over the past few months and is already starting to answer the biggest question mark with his game, his lack of strength. | –",
    "rank": 4
  },
  {
    "id": 5,
    "name": "Tounde Yessoufou",
    "position": "SF,PF",
    "school": "Baylor",
    "height": "6-6",
    "weight": null,
    "talent": 86,
    "notes": "Parsed from big board cell | Baylor (Benin) – Tounde is a bit older for his class and already has a clear NBA-level frame and athleticism | – Tounde",
    "rank": 5
  },
  {
    "id": 6,
    "name": "Chris Cenac Jr",
    "position": "C",
    "school": "Houston",
    "height": "6-10",
    "weight": null,
    "talent": 85,
    "notes": "Parsed from big board cell | Jr | . – 6-10 – | Jr. has elite talent and shows some really special flashes and it’ll be interesting to see who big his role is a on loaded Houston team. He might not have the biggest role or get the most freedom to experiment with the ball in his hands but going to a program like Houston should really help him in the long run with his toughness, rebounding and defense. Even if he doesn’t put up big numbers he has a chance to be a high lottery pick. | – Cenac",
    "rank": 6
  },
  {
    "id": 7,
    "name": "Mikel Brown Jr",
    "position": "PG",
    "school": "Louisville",
    "height": "6-3",
    "weight": null,
    "talent": 84,
    "notes": "Parsed from big board cell | Jr | . – 6-3 – | Jr. is an explosive, elusive and crafty guard who can pour in buckets and impact the game with his scoring and his athleticism. He’s somewhat older for a freshman and doesn’t have elite size for position but he’s clearly loaded with talent. He’s been on of the biggest risers in his class over the past year and is on pace to be a lottery pick. | – Brown",
    "rank": 7
  },
  {
    "id": 8,
    "name": "Jayden Quaintance",
    "position": "PF,C",
    "school": "Kentucky",
    "height": "6-10",
    "weight": null,
    "talent": 83,
    "notes": "Parsed from big board cell | looks like an elite role player type of prospect who rebounds the ball well | 6-10 – | looks like an elite role player type of prospect who rebounds the ball well, has a major impact defending in the lane and is an efficient and effective offensive player. He’s probably not going to be a star but he could be a really good NBA player for a long time. | – JQ",
    "rank": 8
  },
  {
    "id": 9,
    "name": "Caleb Wilson",
    "position": "SF,PF",
    "school": "North Carolina",
    "height": "6-9",
    "weight": null,
    "talent": 82,
    "notes": "Parsed from big board cell | is quickly catching up to his elite tools | 6-9 – | is quickly catching up to his elite tools. He’s got a quick for step, awesome leaping ability and a quickly developing perimeter game. He’s not the biggest or post powerful PF but has some big wing skills and a ton of versatility. | – Wilson has elite athletic ability and a game that",
    "rank": 9
  },
  {
    "id": 10,
    "name": "Miikka Muurinen",
    "position": "SF",
    "school": "Partizan",
    "height": "6-11",
    "weight": null,
    "talent": 81,
    "notes": "Parsed from big board cell | 6-11 – | Belgrade (Finland) – The former high school star who transferred to play pro ball in the ABA will likely be draft eligible in 2026 but could decide to wait until 2027. If he does declare this year he’s a likely top 10 pick with top 5 potential. Miikka is an incredibly skilled and mobile big man who plays more like a big wing at 6-11. He’s got a feathery jumper and a knack for cutting to the lane and finishing above the rim. His minutes might be limited on a talented Partizan team but NBA scouts are well aware of his talents.",
    "rank": 10
  },
  {
    "id": 11,
    "name": "Koa Peat",
    "position": "SF,PF",
    "school": "Arizona",
    "height": "6-8",
    "weight": null,
    "talent": 80,
    "notes": "Parsed from big board cell | Peat is a hard-working and effective forward who doesn’t need the ball in his hands a lot to have a big impact on the game | 6-8 – | Peat is a hard-working and effective forward who doesn’t need the ball in his hands a lot to have a big impact on the game. He’ll likely play a supporting role this season for the Wildcats and might not put up huge numbers but he’s got a game that should translate well to the next level. | –",
    "rank": 11
  },
  {
    "id": 12,
    "name": "Tomislav Ivisic",
    "position": "C",
    "school": "Illinois",
    "height": "7-1",
    "weight": null,
    "talent": 79,
    "notes": "Parsed from big board cell | Illinois (Croatia) – I’m a huge fan of Tomislav’s game and think he is vastly underrated | – I’m a huge fan of Tomislav’s game and think he",
    "rank": 12
  },
  {
    "id": 13,
    "name": "Bennett Stirtz",
    "position": "SG,SF",
    "school": "Iowa",
    "height": "6-4",
    "weight": null,
    "talent": 78,
    "notes": "Parsed from big board cell | 6-4 – | . He has a chance to cement his name on the national stage this season and prove that he’s worthy of this high ranking. He’s a clutch shot-maker and a high level facilitator who could be one of the faces of college basketball this season. | – Stirtz isn’t a big name in mainstream circles but draft nerds know all about his talents",
    "rank": 13
  },
  {
    "id": 14,
    "name": "Dash Daniels",
    "position": "SG,SF",
    "school": "Australia",
    "height": "6-5",
    "weight": null,
    "talent": 77,
    "notes": "Parsed from big board cell | 6-5 – | Daniels just keeps getting better and, as one of the youngest players in the draft class, he has a long runway to continue to improve. He’s not the most flashy offensive talent but his all around game and elite defense give him a lot of value. | – An elite defender with an emerging offensive game",
    "rank": 14
  },
  {
    "id": 15,
    "name": "Brayden Burries",
    "position": "SG,SF",
    "school": "Arizona",
    "height": "6-4",
    "weight": null,
    "talent": 76,
    "notes": "Parsed from big board cell | Burries is a smooth guard with great shot-making ability and a knack for scoring the rock | 6-4 – | Burries is a smooth guard with great shot-making ability and a knack for scoring the rock. He’s not the most twitchy or electric athlete but he’s got good strength and plenty of quickness to get to his spots. His great talent level alleviates any athletic concerns. | –",
    "rank": 15
  },
  {
    "id": 16,
    "name": "Labaron Philon",
    "position": "PG",
    "school": "Alabama",
    "height": "6-3",
    "weight": null,
    "talent": 75,
    "notes": "Parsed from big board cell | Philon is one of the more intriguing guard prospects in the country with his defensive qualities and versatile game | 6-3 – | Philon is one of the more intriguing guard prospects in the country with his defensive qualities and versatile game. If he continues to get stronger and become more consistent shooting the rock it’ll really help his draft stock. | –",
    "rank": 16
  },
  {
    "id": 17,
    "name": "Dame Sarr",
    "position": "SF,PF",
    "school": "Duke",
    "height": "6-7",
    "weight": null,
    "talent": 74,
    "notes": "Parsed from big board cell | Duke (Italy) –  Sarr is loaded with upside ability and it’ll be fascinating to see how he adjusts to the college game | –",
    "rank": 17
  },
  {
    "id": 18,
    "name": "Darius Acuff Jr",
    "position": "PG,SG",
    "school": "Arkansas",
    "height": "6-1",
    "weight": null,
    "talent": 73,
    "notes": "Parsed from big board cell | is wired to score the ball | . – 6-1 – | is wired to score the ball, Acuff Jr. should have a big role in a crowded Arkansas backcourt. He’s not the biggest guard but has a lot of strength and plays with power. He’s a tough eval for me and I’ll be really interested to see what his role is on this team and how he stacks up with and shares the ball with the other talented guards on the roster. | – A tough and hard-nosed guard who",
    "rank": 18
  },
  {
    "id": 19,
    "name": "Karim Lopez",
    "position": "SF",
    "school": "NZ Breakers",
    "height": "6-8",
    "weight": null,
    "talent": 72,
    "notes": "Parsed from big board cell | 6-8 – | NBL (Mexico) – Lopez is an interesting prospect who sometimes looks like a top 10 lock and other times looks a bit lost on the court with major question marks in his game. He’s very young and has a lot of time to work on his weaknesses and, at the end of the day, a 6-8 big wing with his level of scoring instincts will get a long look in the lottery.e",
    "rank": 19
  },
  {
    "id": 20,
    "name": "JT Toppin",
    "position": "PF,C",
    "school": "Texas Tech",
    "height": "6-9",
    "weight": null,
    "talent": 71,
    "notes": "Parsed from big board cell | 6-9 – | . He’s going to put up big numbers on a good Texas Tech team and should be in the running for national player of the year. He’s probably not going to improve his draft stock a ton but he’s just a solid player and a solid prospect with mid/late first round potential. | – Toppin might have been a first rounder last year but chose to return to dominate college basketball",
    "rank": 20
  },
  {
    "id": 21,
    "name": "Thomas Haugh",
    "position": "PF,C",
    "school": "Florida",
    "height": "6-9",
    "weight": null,
    "talent": 70,
    "notes": "Parsed from big board cell | who does all the dirty work and impacts the game | 6-9 – | who does all the dirty work and impacts the game, even when he’s not scoring the ball. A key piece on this loaded Gators team. | – A steady role player",
    "rank": 21
  },
  {
    "id": 22,
    "name": "Yaxel Lendeborg",
    "position": "PF,C",
    "school": "Michigan",
    "height": "6-9",
    "weight": null,
    "talent": 69,
    "notes": "Parsed from big board cell | 6-9 – | . He’s super versatile, has great length and is an impactful player on both ends. | – One of the top transfers in the country Yaxel should put up big numbers for the Wolverines and be in the first round conversation",
    "rank": 22
  },
  {
    "id": 23,
    "name": "Nikolas Khamenia",
    "position": "PF,C",
    "school": "Duke",
    "height": "6-9",
    "weight": null,
    "talent": 68,
    "notes": "Parsed from big board cell | 6-9 – | . I quick decision maker and high IQ player with solid athleticism. Could be a one and done but more likely a multi-year guy. | – A highly skilled scorer with good size",
    "rank": 23
  },
  {
    "id": 24,
    "name": "Neoklis Avdalas",
    "position": "SF",
    "school": "Virginia Tech",
    "height": "6-9",
    "weight": null,
    "talent": 67,
    "notes": "Parsed from big board cell | Virginia Tech (Greece) – A highly skilled big wing who can really pass the rock | – A highly skilled big wing",
    "rank": 24
  },
  {
    "id": 25,
    "name": "Isaiah Evans",
    "position": "SF,PF",
    "school": "Duke",
    "height": "6-7",
    "weight": null,
    "talent": 66,
    "notes": "Parsed from big board cell | 6-7 – | . He’s a streaky shooter who can catch fire from downtown. He’s still very skinny and has some question marks on the defensive end but his offensive fire power could land him in the first round. | – Evans returns for year two and it’ll be interesting to see how he handles a bigger role in the offense",
    "rank": 25
  },
  {
    "id": 26,
    "name": "Hannes Steinback",
    "position": "PF,C",
    "school": "Washington",
    "height": "6-9",
    "weight": null,
    "talent": 65,
    "notes": "Parsed from big board cell | Washington (Germany) – A tough rebounder and skilled offensive player who plays with a lot of energy | – A tough rebounder and skilled offensive player",
    "rank": 26
  },
  {
    "id": 27,
    "name": "Tahaad Pettiford",
    "position": "PG",
    "school": "Auburn",
    "height": "6-1",
    "weight": null,
    "talent": 64,
    "notes": "Parsed from big board cell | Pettiford is just so dynamic with the ball in his hands that he has a shot to be a first rounder | 6-1 – | Pettiford is just so dynamic with the ball in his hands that he has a shot to be a first rounder. He’s got a skinny and wiry frame but good length with a 6-5 wingspan, which helps him hold his own defensively. He’s one of the most exciting, fun and electric players in the county. | – Small guards have a tough time making it in the NBA but",
    "rank": 27
  },
  {
    "id": 28,
    "name": "Karter Knox",
    "position": "SG,SF",
    "school": "Arkansas",
    "height": "6-5",
    "weight": null,
    "talent": 63,
    "notes": "Parsed from big board cell | look like a lottery pick | 6-5 – | look like a lottery pick. If he can get more consistent and take on more of a leadership role this season his draft stock will sky rocket. | – Knox shows flashes that make him",
    "rank": 28
  },
  {
    "id": 29,
    "name": "Elyjah Freeman",
    "position": "SF,PF",
    "school": "Auburn",
    "height": "6-8",
    "weight": null,
    "talent": 62,
    "notes": "Parsed from big board cell | 6-8 – | . He’ll have a big adjustment to make playing against high major talent but he’s got all the tools to excel. | – A small school transfer with big time athletic ability and a good looking outside shot",
    "rank": 29
  },
  {
    "id": 30,
    "name": "Isiah Harwell",
    "position": "SG",
    "school": "Houston",
    "height": "6-5",
    "weight": null,
    "talent": 61,
    "notes": "Parsed from big board cell | who has clear NBA potential but could be a two or three year player | 6-5 – | who has clear NBA potential but could be a two or three year player. | – A high level shooter and scorer",
    "rank": 30
  },
  {
    "id": 31,
    "name": "Magoon Gwath",
    "position": "C",
    "school": "San Diego State",
    "height": "7-0",
    "weight": null,
    "talent": 60,
    "notes": "Parsed from big board cell | 7-0 – | . While he’s very intriguing he could be a year or two away from being NBA ready. | – Has unique movement skills for a 7-footer and an intriguing combination of outside shot-making and shot blocking abilities",
    "rank": 31
  },
  {
    "id": 32,
    "name": "Cayden Boozer",
    "position": "SG,SF",
    "school": "Duke",
    "height": "6-4",
    "weight": null,
    "talent": 59,
    "notes": "Parsed from big board cell | (The other) Boozer is an outside shot away from being a complete player and a first round pick | 6-4 – | (The other) Boozer is an outside shot away from being a complete player and a first round pick. If his shot falls this year he’ll be one of the best guards in college basketball, with his passing vision, knack for scoring in the lane and defensive intensity. Even if the shot doesn’t totally pan out he’ll be a great college player who will go on to have a long pro career. | –",
    "rank": 32
  },
  {
    "id": 33,
    "name": "Alex Condon",
    "position": "C",
    "school": "Florida",
    "height": "6-11",
    "weight": null,
    "talent": 58,
    "notes": "Parsed from big board cell | Florida (Australia) – Condon does a lot the dirty work of setting screens | – Condon does a lot the dirty work of setting screens",
    "rank": 33
  },
  {
    "id": 34,
    "name": "Alex Karaban",
    "position": "SF,PF",
    "school": "UConn",
    "height": "6-8",
    "weight": null,
    "talent": 57,
    "notes": "Parsed from big board cell | Karaban will go down as one of the greats in the UConn programs history | 6-8 – | Karaban will go down as one of the greats in the UConn programs history. His NBA role is a little murky but big shot-makers have value and he’ll get a long look from NBA teams. He might not be a high upside guy but he does some things at a high level and has a chance to be a solid role player at the next level. | –",
    "rank": 34
  },
  {
    "id": 35,
    "name": "Henri Veesaar",
    "position": "C",
    "school": "North Carolina",
    "height": "7-0",
    "weight": null,
    "talent": 56,
    "notes": "Parsed from big board cell | North Carolina (Estonia) – The Arizona transfer will play a big role in the Tar Heel frontcourt | – The Arizona transfer",
    "rank": 35
  },
  {
    "id": 36,
    "name": "Kam Williams",
    "position": "SF",
    "school": "Kentucky",
    "height": "6-8",
    "weight": null,
    "talent": 55,
    "notes": "Parsed from big board cell | 6-8 – | good awareness on the offensive end and good positional size. Should be one of the more impactful transfers in the SEC. | – A smooth operator on the wing with a good looking jumper",
    "rank": 36
  },
  {
    "id": 37,
    "name": "Boogie Fland",
    "position": "PG",
    "school": "Florida",
    "height": "6-3",
    "weight": null,
    "talent": 54,
    "notes": "Parsed from big board cell | has great handles | 6-3 – | has great handles, good quickness and scoring instincts. He projects as a potentially great college player but his role at the next level could be limited. Will he be a bench guard in the NBA or end up overseas? | – Boogie lacks ideal size but",
    "rank": 37
  },
  {
    "id": 38,
    "name": "Braylon Mullins",
    "position": "SG,SF",
    "school": "UConn",
    "height": "6-5",
    "weight": null,
    "talent": 53,
    "notes": "Parsed from big board cell | 6-5 – | . He’s got a world of talent and a great looking outside shot but could be more of a two-year guy then a one and done. | – It’ll be fascinating to see how much run Mullins gets on a very deep UConn team",
    "rank": 38
  },
  {
    "id": 39,
    "name": "Coen Carr",
    "position": "SF,PF",
    "school": "Michigan State",
    "height": "6-7",
    "weight": null,
    "talent": 52,
    "notes": "Parsed from big board cell | Carr | 6-7 – | Carr. He’s an insane above the rim player but is also starting to round out his game and is on a nice trajectory as a prospect. | – There’s athleticism and then there’s Coen",
    "rank": 39
  },
  {
    "id": 40,
    "name": "Omer Mayer",
    "position": "SG,SF",
    "school": "Purdue",
    "height": "6-4",
    "weight": null,
    "talent": 51,
    "notes": "Parsed from big board cell | Mayer is a big time talent who will play a supportive role in year one for the Boilermakers and will probably end up as a multi-year player but I had to put him on this list as I think he’s one of the top 70 draft eligible NBA prospects | 6-4 – | Mayer is a big time talent who will play a supportive role in year one for the Boilermakers and will probably end up as a multi-year player but I had to put him on this list as I think he’s one of the top 70 draft eligible NBA prospects. | –",
    "rank": 40
  },
  {
    "id": 41,
    "name": "Tyrone Riley",
    "position": "SF,PF",
    "school": "USF",
    "height": "6-6",
    "weight": null,
    "talent": 50,
    "notes": "Parsed from big board cell | Riley who chose to stay at USF and be the man instead of transfer up | 6-6 – | Riley who chose to stay at USF and be the man instead of transfer up. He instantly passes the eye test and has NBA level tools but will have to take the next steps with his play-making and perimeter shooting. | – This could end up being way too low for",
    "rank": 41
  },
  {
    "id": 42,
    "name": "Dailyn Swain",
    "position": "SF,PF",
    "school": "Texas",
    "height": "6-8",
    "weight": null,
    "talent": 49,
    "notes": "Parsed from big board cell | will have to continue to develop his game | 6-8 – | will have to continue to develop his game. Shows some really nice flashes. | – An NBA level athlete with all the tools but",
    "rank": 42
  },
  {
    "id": 43,
    "name": "Milos Uzan",
    "position": "PG",
    "school": "Houston",
    "height": "6-5",
    "weight": null,
    "talent": 48,
    "notes": "Parsed from big board cell | Uzan is a big point guard with great passing vision and the mental make-up you look for in a PG/leader | 6-5 – | Uzan is a big point guard with great passing vision and the mental make-up you look for in a PG/leader. He’s a feisty defender who really gets after ball handlers. | –",
    "rank": 43
  },
  {
    "id": 44,
    "name": "Solo Ball",
    "position": "PG",
    "school": "UConn",
    "height": "6-3",
    "weight": null,
    "talent": 47,
    "notes": "Parsed from big board cell | Ball is a dynamic athlete who is learning to harness his ability and is becoming a more complete guard | 6-3 – | Ball is a dynamic athlete who is learning to harness his ability and is becoming a more complete guard. He’s a blur in the open court and excels at taking it to the rim. | –",
    "rank": 44
  },
  {
    "id": 45,
    "name": "Dwayne Aristode",
    "position": "SF,PF",
    "school": "Arizona",
    "height": "6-7",
    "weight": null,
    "talent": 46,
    "notes": "Parsed from big board cell | Arizona (Netherlands) – When it’s all said and done this ranking could be way too low | – When it’s all said and done this ranking",
    "rank": 45
  }
]